/*
После окончания кардебалета Ёжик решил записать в книжечку натуральные числа на клеточном тетрадном листе по специальному правилу. Он начинает с числа ﻿11﻿ в левом верхнем углу и затем продолжает по диагоналям: справа от первого числа он записывает ﻿22﻿, а под ним — ﻿33﻿. На следующей диагонали будут числа ﻿44﻿, ﻿55﻿ и ﻿66﻿, и так далее.

Предположим, что ширина листа составляет ﻿nn﻿ клеток, а высота равна ﻿mm﻿ клеткам. Ваша задача помочь Ёжику и показать, как будут записаны числа!

Формат входных данных

В единственной строке ввода через пробел записаны числа ﻿nn﻿ и ﻿mm﻿ ﻿(1 \leq n, m \leq 2 \cdot 10^5; 1 \leq n \cdot m \leq 2 \cdot 10^5)(1≤n,m≤2⋅10
5
 ;1≤n⋅m≤2⋅10
5
 )﻿ — размеры листа из книжечки.

Формат выходных данных

Выведите все натуральные числа от 11 до n \cdot mn⋅m в указанном формате, разделяя числа в одной строке пробелами, а между строками — переводами строки.


Ввод
3 3
Вывод:
1 2 4
3 5 7
6 8 9

Ввод:
4 3
Вывод:
1 2 4 7
3 5 8 10
6 9 11 12

*/
package tinkoff;

public class ChislaPoDiagonali {
}
