/*
Ещё с детства Лосяш любит сложные геометрические объекты. Сейчас ему особенно нравятся окружности, тетраэдры и тессеракты, но в детстве он еще даже таких слов не знал, а потому пользовался тем, что было под рукой — квадратами.

Квадрат — самая простая в обращении фигура. Их можно прикладывать друг к другу, и их стороны будут оставаться параллельны или перпендикулярны друг другу. А если очень повезёт, положив рядом несколько квадратов, можно получить новый квадрат!

Давайте поможем Лосяшу определить, можно ли положить друг рядом с другом четыре квадрата со сторонами ﻿d_1d
1
​
 ﻿, ﻿d_2d
2
​
 ﻿, ﻿d_3d
3
​
 ﻿ и ﻿d_4d
4
​
 ﻿ так, чтобы каждые два квадрата либо соприкасались по стороне, либо касались углом, либо не пересекались вообще, и при этом чтобы их объединение образовывало бы большой квадрат.

Формат входных данных

В единственной строке ввода через пробел даны четыре числа ﻿d_id
i
​
 ﻿ ﻿(1 \leq d_i \leq 10^9)(1≤d
i
​
 ≤10
9
 )﻿ — стороны квадратов.

Формат выходных данных

Выведите «﻿YESYES﻿» (без кавычек), если эти четыре квадрата могут образовывать один большой квадрат, и «﻿NONO﻿» иначе.

Примеры данных
Пример 1
3 3 3 3
3 3 3 3
YES
YES
Пример 2
3 3 2 3
3 3 2 3
NO

* */

package tinkoff;

public class Qvadat {
}
